MikroElektronika/core_packages/PIC/XC8/def/PIC18LF47K42/mcu.h
extern volatile IOCBPbits_t IOCBPbits __at(0x3A55);
// bitfield macros
#define _IOCBP_IOCBP0_POSN                                  0x0
#define _IOCBP_IOCBP0_POSITION                              0x0
#define _IOCBP_IOCBP0_SIZE                                  0x1
#define _IOCBP_IOCBP0_LENGTH                                0x1
#define _IOCBP_IOCBP0_MASK                                  0x1
#define _IOCBP_IOCBP1_POSN                                  0x1
#define _IOCBP_IOCBP1_POSITION                              0x1
#define _IOCBP_IOCBP1_SIZE                                  0x1
#define _IOCBP_IOCBP1_LENGTH                                0x1
#define _IOCBP_IOCBP1_MASK                                  0x2
#define _IOCBP_IOCBP2_POSN                                  0x2
#define _IOCBP_IOCBP2_POSITION                              0x2
#define _IOCBP_IOCBP2_SIZE                                  0x1
#define _IOCBP_IOCBP2_LENGTH                                0x1
#define _IOCBP_IOCBP2_MASK                                  0x4
#define _IOCBP_IOCBP3_POSN                                  0x3
#define _IOCBP_IOCBP3_POSITION                              0x3
#define _IOCBP_IOCBP3_SIZE                                  0x1
#define _IOCBP_IOCBP3_LENGTH                                0x1
#define _IOCBP_IOCBP3_MASK                                  0x8
#define _IOCBP_IOCBP4_POSN                                  0x4
#define _IOCBP_IOCBP4_POSITION                              0x4
#define _IOCBP_IOCBP4_SIZE                                  0x1
#define _IOCBP_IOCBP4_LENGTH                                0x1
#define _IOCBP_IOCBP4_MASK                                  0x10
#define _IOCBP_IOCBP5_POSN                                  0x5
#define _IOCBP_IOCBP5_POSITION                              0x5
#define _IOCBP_IOCBP5_SIZE                                  0x1
#define _IOCBP_IOCBP5_LENGTH                                0x1
#define _IOCBP_IOCBP5_MASK                                  0x20
#define _IOCBP_IOCBP6_POSN                                  0x6
#define _IOCBP_IOCBP6_POSITION                              0x6
#define _IOCBP_IOCBP6_SIZE                                  0x1
#define _IOCBP_IOCBP6_LENGTH                                0x1
#define _IOCBP_IOCBP6_MASK                                  0x40
#define _IOCBP_IOCBP7_POSN                                  0x7
#define _IOCBP_IOCBP7_POSITION                              0x7
#define _IOCBP_IOCBP7_SIZE                                  0x1
#define _IOCBP_IOCBP7_LENGTH                                0x1
#define _IOCBP_IOCBP7_MASK                                  0x80

// Register: IOCBN
#define IOCBN IOCBN
extern volatile unsigned char           IOCBN               __at(0x3A56);
#ifndef _LIB_BUILD
asm("IOCBN equ 03A56h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IOCBN0                 :1;
        unsigned IOCBN1                 :1;
        unsigned IOCBN2                 :1;
        unsigned IOCBN3                 :1;
        unsigned IOCBN4                 :1;
        unsigned IOCBN5                 :1;
        unsigned IOCBN6                 :1;
        unsigned IOCBN7                 :1;
    };
} IOCBNbits_t;
extern volatile IOCBNbits_t IOCBNbits __at(0x3A56);
// bitfield macros
#define _IOCBN_IOCBN0_POSN                                  0x0
#define _IOCBN_IOCBN0_POSITION                              0x0
#define _IOCBN_IOCBN0_SIZE                                  0x1
#define _IOCBN_IOCBN0_LENGTH                                0x1
#define _IOCBN_IOCBN0_MASK                                  0x1
#define _IOCBN_IOCBN1_POSN                                  0x1
#define _IOCBN_IOCBN1_POSITION                              0x1
#define _IOCBN_IOCBN1_SIZE                                  0x1
#define _IOCBN_IOCBN1_LENGTH                                0x1
#define _IOCBN_IOCBN1_MASK                                  0x2
#define _IOCBN_IOCBN2_POSN                                  0x2
#define _IOCBN_IOCBN2_POSITION                              0x2
#define _IOCBN_IOCBN2_SIZE                                  0x1
#define _IOCBN_IOCBN2_LENGTH                                0x1
#define _IOCBN_IOCBN2_MASK                                  0x4
#define _IOCBN_IOCBN3_POSN                                  0x3
#define _IOCBN_IOCBN3_POSITION                              0x3
#define _IOCBN_IOCBN3_SIZE                                  0x1
#define _IOCBN_IOCBN3_LENGTH                                0x1
#define _IOCBN_IOCBN3_MASK                                  0x8
#define _IOCBN_IOCBN4_POSN                                  0x4
#define _IOCBN_IOCBN4_POSITION                              0x4
#define _IOCBN_IOCBN4_SIZE                                  0x1
#define _IOCBN_IOCBN4_LENGTH                                0x1
#define _IOCBN_IOCBN4_MASK                                  0x10
#define _IOCBN_IOCBN5_POSN                                  0x5
#define _IOCBN_IOCBN5_POSITION                              0x5
#define _IOCBN_IOCBN5_SIZE                                  0x1
#define _IOCBN_IOCBN5_LENGTH                                0x1
#define _IOCBN_IOCBN5_MASK                                  0x20
#define _IOCBN_IOCBN6_POSN                                  0x6
#define _IOCBN_IOCBN6_POSITION                              0x6
#define _IOCBN_IOCBN6_SIZE                                  0x1
#define _IOCBN_IOCBN6_LENGTH                                0x1
#define _IOCBN_IOCBN6_MASK                                  0x40
#define _IOCBN_IOCBN7_POSN                                  0x7
#define _IOCBN_IOCBN7_POSITION                              0x7
#define _IOCBN_IOCBN7_SIZE                                  0x1
#define _IOCBN_IOCBN7_LENGTH                                0x1
#define _IOCBN_IOCBN7_MASK                                  0x80

// Register: IOCBF
#define IOCBF IOCBF
extern volatile unsigned char           IOCBF               __at(0x3A57);
#ifndef _LIB_BUILD
asm("IOCBF equ 03A57h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IOCBF0                 :1;
        unsigned IOCBF1                 :1;
        unsigned IOCBF2                 :1;
        unsigned IOCBF3                 :1;
        unsigned IOCBF4                 :1;
        unsigned IOCBF5                 :1;
        unsigned IOCBF6                 :1;
        unsigned IOCBF7                 :1;
    };
} IOCBFbits_t;
extern volatile IOCBFbits_t IOCBFbits __at(0x3A57);
// bitfield macros
#define _IOCBF_IOCBF0_POSN                                  0x0
#define _IOCBF_IOCBF0_POSITION                              0x0
#define _IOCBF_IOCBF0_SIZE                                  0x1
#define _IOCBF_IOCBF0_LENGTH                                0x1
#define _IOCBF_IOCBF0_MASK                                  0x1
#define _IOCBF_IOCBF1_POSN                                  0x1
#define _IOCBF_IOCBF1_POSITION                              0x1
#define _IOCBF_IOCBF1_SIZE                                  0x1
#define _IOCBF_IOCBF1_LENGTH                                0x1
#define _IOCBF_IOCBF1_MASK                                  0x2
#define _IOCBF_IOCBF2_POSN                                  0x2
#define _IOCBF_IOCBF2_POSITION                              0x2
#define _IOCBF_IOCBF2_SIZE                                  0x1
#define _IOCBF_IOCBF2_LENGTH                                0x1
#define _IOCBF_IOCBF2_MASK                                  0x4
#define _IOCBF_IOCBF3_POSN                                  0x3
#define _IOCBF_IOCBF3_POSITION                              0x3
#define _IOCBF_IOCBF3_SIZE                                  0x1
#define _IOCBF_IOCBF3_LENGTH                                0x1
#define _IOCBF_IOCBF3_MASK                                  0x8
#define _IOCBF_IOCBF4_POSN                                  0x4
#define _IOCBF_IOCBF4_POSITION                              0x4
#define _IOCBF_IOCBF4_SIZE                                  0x1
#define _IOCBF_IOCBF4_LENGTH                                0x1
#define _IOCBF_IOCBF4_MASK                                  0x10
#define _IOCBF_IOCBF5_POSN                                  0x5
#define _IOCBF_IOCBF5_POSITION                              0x5
#define _IOCBF_IOCBF5_SIZE                                  0x1
#define _IOCBF_IOCBF5_LENGTH                                0x1
#define _IOCBF_IOCBF5_MASK                                  0x20
#define _IOCBF_IOCBF6_POSN                                  0x6
#define _IOCBF_IOCBF6_POSITION                              0x6
#define _IOCBF_IOCBF6_SIZE                                  0x1
#define _IOCBF_IOCBF6_LENGTH                                0x1
#define _IOCBF_IOCBF6_MASK                                  0x40
#define _IOCBF_IOCBF7_POSN                                  0x7
#define _IOCBF_IOCBF7_POSITION                              0x7
#define _IOCBF_IOCBF7_SIZE                                  0x1
#define _IOCBF_IOCBF7_LENGTH                                0x1
#define _IOCBF_IOCBF7_MASK                                  0x80

// Register: RB1I2C
#define RB1I2C RB1I2C
extern volatile unsigned char           RB1I2C              __at(0x3A5A);
#ifndef _LIB_BUILD
asm("RB1I2C equ 03A5Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TH                     :2;
        unsigned                        :2;
        unsigned PU                     :2;
        unsigned SLEW                   :1;
    };
    struct {
        unsigned TH0                    :1;
        unsigned TH1                    :1;
        unsigned                        :2;
        unsigned _PU0                    :1;  // Note: Changed by MikroE
        unsigned _PU1                    :1;  // Note: Changed by MikroE
    };
    struct {
        unsigned I2CTH                  :2;
        unsigned                        :2;
        unsigned I2CPU                  :2;
        unsigned I2CSLEW                :1;
    };
    struct {
        unsigned I2CTH0                 :1;
        unsigned I2CTH1                 :1;
        unsigned                        :2;
        unsigned I2CPU0                 :1;
        unsigned I2CPU1                 :1;
    };
} RB1I2Cbits_t;
extern volatile RB1I2Cbits_t RB1I2Cbits __at(0x3A5A);
// bitfield macros
#define _RB1I2C_TH_POSN                                     0x0
#define _RB1I2C_TH_POSITION                                 0x0
#define _RB1I2C_TH_SIZE                                     0x2
#define _RB1I2C_TH_LENGTH                                   0x2
#define _RB1I2C_TH_MASK                                     0x3
#define _RB1I2C_PU_POSN                                     0x4
#define _RB1I2C_PU_POSITION                                 0x4
#define _RB1I2C_PU_SIZE                                     0x2
#define _RB1I2C_PU_LENGTH                                   0x2
#define _RB1I2C_PU_MASK                                     0x30
#define _RB1I2C_SLEW_POSN                                   0x6
#define _RB1I2C_SLEW_POSITION                               0x6
#define _RB1I2C_SLEW_SIZE                                   0x1
#define _RB1I2C_SLEW_LENGTH                                 0x1
#define _RB1I2C_SLEW_MASK                                   0x40
#define _RB1I2C_TH0_POSN                                    0x0
#define _RB1I2C_TH0_POSITION                                0x0
#define _RB1I2C_TH0_SIZE                                    0x1
#define _RB1I2C_TH0_LENGTH                                  0x1
#define _RB1I2C_TH0_MASK                                    0x1
#define _RB1I2C_TH1_POSN                                    0x1
#define _RB1I2C_TH1_POSITION                                0x1
#define _RB1I2C_TH1_SIZE                                    0x1
#define _RB1I2C_TH1_LENGTH                                  0x1
#define _RB1I2C_TH1_MASK                                    0x2
#define _RB1I2C_PU0_POSN                                    0x4
#define _RB1I2C_PU0_POSITION                                0x4
#define _RB1I2C_PU0_SIZE                                    0x1
#define _RB1I2C_PU0_LENGTH                                  0x1
#define _RB1I2C_PU0_MASK                                    0x10
#define _RB1I2C_PU1_POSN                                    0x5
#define _RB1I2C_PU1_POSITION                                0x5
#define _RB1I2C_PU1_SIZE                                    0x1
#define _RB1I2C_PU1_LENGTH                                  0x1
#define _RB1I2C_PU1_MASK                                    0x20
#define _RB1I2C_I2CTH_POSN                                  0x0
#define _RB1I2C_I2CTH_POSITION                              0x0
#define _RB1I2C_I2CTH_SIZE                                  0x2
#define _RB1I2C_I2CTH_LENGTH                                0x2
#define _RB1I2C_I2CTH_MASK                                  0x3
#define _RB1I2C_I2CPU_POSN                                  0x4
#define _RB1I2C_I2CPU_POSITION                              0x4
#define _RB1I2C_I2CPU_SIZE                                  0x2
#define _RB1I2C_I2CPU_LENGTH                                0x2
#define _RB1I2C_I2CPU_MASK                                  0x30
#define _RB1I2C_I2CSLEW_POSN                                0x6
#define _RB1I2C_I2CSLEW_POSITION                            0x6
#define _RB1I2C_I2CSLEW_SIZE                                0x1
#define _RB1I2C_I2CSLEW_LENGTH                              0x1
#define _RB1I2C_I2CSLEW_MASK                                0x40
#define _RB1I2C_I2CTH0_POSN                                 0x0
#define _RB1I2C_I2CTH0_POSITION                             0x0
#define _RB1I2C_I2CTH0_SIZE                                 0x1
#define _RB1I2C_I2CTH0_LENGTH                               0x1
#define _RB1I2C_I2CTH0_MASK                                 0x1
#define _RB1I2C_I2CTH1_POSN                                 0x1
#define _RB1I2C_I2CTH1_POSITION                             0x1
#define _RB1I2C_I2CTH1_SIZE                                 0x1
#define _RB1I2C_I2CTH1_LENGTH                               0x1
#define _RB1I2C_I2CTH1_MASK                                 0x2
#define _RB1I2C_I2CPU0_POSN                                 0x4
#define _RB1I2C_I2CPU0_POSITION                             0x4
#define _RB1I2C_I2CPU0_SIZE                                 0x1
#define _RB1I2C_I2CPU0_LENGTH                               0x1
#define _RB1I2C_I2CPU0_MASK                                 0x10
#define _RB1I2C_I2CPU1_POSN                                 0x5
#define _RB1I2C_I2CPU1_POSITION                             0x5
#define _RB1I2C_I2CPU1_SIZE                                 0x1
#define _RB1I2C_I2CPU1_LENGTH                               0x1
#define _RB1I2C_I2CPU1_MASK                                 0x20

// Register: RB2I2C
#define RB2I2C RB2I2C
extern volatile unsigned char           RB2I2C              __at(0x3A5B);
#ifndef _LIB_BUILD
asm("RB2I2C equ 03A5Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TH                     :2;
        unsigned                        :2;
        unsigned PU                     :2;
        unsigned SLEW                   :1;
    };
    struct {
        unsigned TH0                    :1;
        unsigned TH1                    :1;
        unsigned                        :2;
        unsigned _PU0                    :1;  // Note: Changed by MikroE
        unsigned _PU1                    :1;  // Note: Changed by MikroE
    };
    struct {
        unsigned I2CTH                  :2;
        unsigned                        :2;
        unsigned I2CPU                  :2;
        unsigned I2CSLEW                :1;
    };
    struct {
        unsigned I2CTH0                 :1;
        unsigned I2CTH1                 :1;
        unsigned                        :2;
        unsigned I2CPU0                 :1;
        unsigned I2CPU1                 :1;
    };
} RB2I2Cbits_t;
extern volatile RB2I2Cbits_t RB2I2Cbits __at(0x3A5B);
// bitfield macros
#define _RB2I2C_TH_POSN                                     0x0
#define _RB2I2C_TH_POSITION                                 0x0
#define _RB2I2C_TH_SIZE                                     0x2
#define _RB2I2C_TH_LENGTH                                   0x2
#define _RB2I2C_TH_MASK                                     0x3
#define _RB2I2C_PU_POSN                                     0x4
#define _RB2I2C_PU_POSITION                                 0x4
#define _RB2I2C_PU_SIZE                                     0x2
#define _RB2I2C_PU_LENGTH                                   0x2
#define _RB2I2C_PU_MASK                                     0x30
#define _RB2I2C_SLEW_POSN                                   0x6
#define _RB2I2C_SLEW_POSITION                               0x6
#define _RB2I2C_SLEW_SIZE                                   0x1
#define _RB2I2C_SLEW_LENGTH                                 0x1
#define _RB2I2C_SLEW_MASK                                   0x40
#define _RB2I2C_TH0_POSN                                    0x0
#define _RB2I2C_TH0_POSITION                                0x0
#define _RB2I2C_TH0_SIZE                                    0x1
#define _RB2I2C_TH0_LENGTH                                  0x1
#define _RB2I2C_TH0_MASK                                    0x1
#define _RB2I2C_TH1_POSN                                    0x1
#define _RB2I2C_TH1_POSITION                                0x1
#define _RB2I2C_TH1_SIZE                                    0x1
#define _RB2I2C_TH1_LENGTH                                  0x1
#define _RB2I2C_TH1_MASK                                    0x2
#define _RB2I2C_PU0_POSN                                    0x4
#define _RB2I2C_PU0_POSITION                                0x4
#define _RB2I2C_PU0_SIZE                                    0x1
#define _RB2I2C_PU0_LENGTH                                  0x1
#define _RB2I2C_PU0_MASK                                    0x10
#define _RB2I2C_PU1_POSN                                    0x5
#define _RB2I2C_PU1_POSITION                                0x5
#define _RB2I2C_PU1_SIZE                                    0x1
#define _RB2I2C_PU1_LENGTH                                  0x1
#define _RB2I2C_PU1_MASK                                    0x20
#define _RB2I2C_I2CTH_POSN                                  0x0
#define _RB2I2C_I2CTH_POSITION                              0x0
#define _RB2I2C_I2CTH_SIZE                                  0x2
#define _RB2I2C_I2CTH_LENGTH                                0x2
#define _RB2I2C_I2CTH_MASK                                  0x3
#define _RB2I2C_I2CPU_POSN                                  0x4
#define _RB2I2C_I2CPU_POSITION                              0x4
#define _RB2I2C_I2CPU_SIZE                                  0x2
#define _RB2I2C_I2CPU_LENGTH                                0x2
#define _RB2I2C_I2CPU_MASK                                  0x30
#define _RB2I2C_I2CSLEW_POSN                                0x6
#define _RB2I2C_I2CSLEW_POSITION                            0x6
#define _RB2I2C_I2CSLEW_SIZE                                0x1
#define _RB2I2C_I2CSLEW_LENGTH                              0x1
#define _RB2I2C_I2CSLEW_MASK                                0x40
#define _RB2I2C_I2CTH0_POSN                                 0x0
#define _RB2I2C_I2CTH0_POSITION                             0x0
#define _RB2I2C_I2CTH0_SIZE                                 0x1
#define _RB2I2C_I2CTH0_LENGTH                               0x1
#define _RB2I2C_I2CTH0_MASK                                 0x1
#define _RB2I2C_I2CTH1_POSN                                 0x1
#define _RB2I2C_I2CTH1_POSITION                             0x1
#define _RB2I2C_I2CTH1_SIZE                                 0x1
#define _RB2I2C_I2CTH1_LENGTH                               0x1
#define _RB2I2C_I2CTH1_MASK                                 0x2
#define _RB2I2C_I2CPU0_POSN                                 0x4
#define _RB2I2C_I2CPU0_POSITION                             0x4
#define _RB2I2C_I2CPU0_SIZE                                 0x1
#define _RB2I2C_I2CPU0_LENGTH                               0x1
#define _RB2I2C_I2CPU0_MASK                                 0x10
#define _RB2I2C_I2CPU1_POSN                                 0x5
#define _RB2I2C_I2CPU1_POSITION                             0x5
#define _RB2I2C_I2CPU1_SIZE                                 0x1
#define _RB2I2C_I2CPU1_LENGTH                               0x1
#define _RB2I2C_I2CPU1_MASK                                 0x20

// Register: ANSELC
#define ANSELC ANSELC
extern volatile unsigned char           ANSELC              __at(0x3A60);
#ifndef _LIB_BUILD
asm("ANSELC equ 03A60h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANSELC0                :1;
        unsigned ANSELC1                :1;
        unsigned ANSELC2                :1;
        unsigned ANSELC3                :1;
        unsigned ANSELC4                :1;
        unsigned ANSELC5                :1;
        unsigned ANSELC6                :1;
        unsigned ANSELC7                :1;
    };
} ANSELCbits_t;
extern volatile ANSELCbits_t ANSELCbits __at(0x3A60);
// bitfield macros
#define _ANSELC_ANSELC0_POSN                                0x0
#define _ANSELC_ANSELC0_POSITION                            0x0
#define _ANSELC_ANSELC0_SIZE                                0x1
#define _ANSELC_ANSELC0_LENGTH                              0x1
#define _ANSELC_ANSELC0_MASK                                0x1
#define _ANSELC_ANSELC1_POSN                                0x1
#define _ANSELC_ANSELC1_POSITION                            0x1
#define _ANSELC_ANSELC1_SIZE                                0x1
#define _ANSELC_ANSELC1_LENGTH                              0x1
#define _ANSELC_ANSELC1_MASK                                0x2
#define _ANSELC_ANSELC2_POSN                                0x2
#define _ANSELC_ANSELC2_POSITION                            0x2
#define _ANSELC_ANSELC2_SIZE                                0x1
#define _ANSELC_ANSELC2_LENGTH                              0x1
#define _ANSELC_ANSELC2_MASK                                0x4
#define _ANSELC_ANSELC3_POSN                                0x3
#define _ANSELC_ANSELC3_POSITION                            0x3
#define _ANSELC_ANSELC3_SIZE                                0x1
#define _ANSELC_ANSELC3_LENGTH                              0x1
#define _ANSELC_ANSELC3_MASK                                0x8
#define _ANSELC_ANSELC4_POSN                                0x4
#define _ANSELC_ANSELC4_POSITION                            0x4
#define _ANSELC_ANSELC4_SIZE                                0x1
#define _ANSELC_ANSELC4_LENGTH                              0x1
#define _ANSELC_ANSELC4_MASK                                0x10
#define _ANSELC_ANSELC5_POSN                                0x5
#define _ANSELC_ANSELC5_POSITION                            0x5
#define _ANSELC_ANSELC5_SIZE                                0x1
#define _ANSELC_ANSELC5_LENGTH                              0x1
#define _ANSELC_ANSELC5_MASK                                0x20
#define _ANSELC_ANSELC6_POSN                                0x6
#define _ANSELC_ANSELC6_POSITION                            0x6
#define _ANSELC_ANSELC6_SIZE                                0x1
#define _ANSELC_ANSELC6_LENGTH                              0x1
#define _ANSELC_ANSELC6_MASK                                0x40
#define _ANSELC_ANSELC7_POSN                                0x7
#define _ANSELC_ANSELC7_POSITION                            0x7
#define _ANSELC_ANSELC7_SIZE                                0x1
#define _ANSELC_ANSELC7_LENGTH                              0x1
#define _ANSELC_ANSELC7_MASK                                0x80

