MikroElektronika/core_packages/PIC/XC8/def/PIC18LF47K42/mcu.h
extern volatile SPI1TXBbits_t SPI1TXBbits __at(0x3D11);
// bitfield macros
#define _SPI1TXB_TXB_POSN                                   0x0
#define _SPI1TXB_TXB_POSITION                               0x0
#define _SPI1TXB_TXB_SIZE                                   0x8
#define _SPI1TXB_TXB_LENGTH                                 0x8
#define _SPI1TXB_TXB_MASK                                   0xFF
#define _SPI1TXB_TXB0_POSN                                  0x0
#define _SPI1TXB_TXB0_POSITION                              0x0
#define _SPI1TXB_TXB0_SIZE                                  0x1
#define _SPI1TXB_TXB0_LENGTH                                0x1
#define _SPI1TXB_TXB0_MASK                                  0x1
#define _SPI1TXB_TXB1_POSN                                  0x1
#define _SPI1TXB_TXB1_POSITION                              0x1
#define _SPI1TXB_TXB1_SIZE                                  0x1
#define _SPI1TXB_TXB1_LENGTH                                0x1
#define _SPI1TXB_TXB1_MASK                                  0x2
#define _SPI1TXB_TXB2_POSN                                  0x2
#define _SPI1TXB_TXB2_POSITION                              0x2
#define _SPI1TXB_TXB2_SIZE                                  0x1
#define _SPI1TXB_TXB2_LENGTH                                0x1
#define _SPI1TXB_TXB2_MASK                                  0x4
#define _SPI1TXB_TXB3_POSN                                  0x3
#define _SPI1TXB_TXB3_POSITION                              0x3
#define _SPI1TXB_TXB3_SIZE                                  0x1
#define _SPI1TXB_TXB3_LENGTH                                0x1
#define _SPI1TXB_TXB3_MASK                                  0x8
#define _SPI1TXB_TXB4_POSN                                  0x4
#define _SPI1TXB_TXB4_POSITION                              0x4
#define _SPI1TXB_TXB4_SIZE                                  0x1
#define _SPI1TXB_TXB4_LENGTH                                0x1
#define _SPI1TXB_TXB4_MASK                                  0x10
#define _SPI1TXB_TXB5_POSN                                  0x5
#define _SPI1TXB_TXB5_POSITION                              0x5
#define _SPI1TXB_TXB5_SIZE                                  0x1
#define _SPI1TXB_TXB5_LENGTH                                0x1
#define _SPI1TXB_TXB5_MASK                                  0x20
#define _SPI1TXB_TXB6_POSN                                  0x6
#define _SPI1TXB_TXB6_POSITION                              0x6
#define _SPI1TXB_TXB6_SIZE                                  0x1
#define _SPI1TXB_TXB6_LENGTH                                0x1
#define _SPI1TXB_TXB6_MASK                                  0x40
#define _SPI1TXB_TXB7_POSN                                  0x7
#define _SPI1TXB_TXB7_POSITION                              0x7
#define _SPI1TXB_TXB7_SIZE                                  0x1
#define _SPI1TXB_TXB7_LENGTH                                0x1
#define _SPI1TXB_TXB7_MASK                                  0x80

// Register: SPI1TCNT
#define SPI1TCNT SPI1TCNT
extern volatile unsigned short          SPI1TCNT            __at(0x3D12);
#ifndef _LIB_BUILD
asm("SPI1TCNT equ 03D12h");
#endif

// Register: SPI1TCNTL
#define SPI1TCNTL SPI1TCNTL
extern volatile unsigned char           SPI1TCNTL           __at(0x3D12);
#ifndef _LIB_BUILD
asm("SPI1TCNTL equ 03D12h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TCNTL                  :8;
    };
} SPI1TCNTLbits_t;
extern volatile SPI1TCNTLbits_t SPI1TCNTLbits __at(0x3D12);
// bitfield macros
#define _SPI1TCNTL_TCNTL_POSN                               0x0
#define _SPI1TCNTL_TCNTL_POSITION                           0x0
#define _SPI1TCNTL_TCNTL_SIZE                               0x8
#define _SPI1TCNTL_TCNTL_LENGTH                             0x8
#define _SPI1TCNTL_TCNTL_MASK                               0xFF

// Register: SPI1TCNTH
#define SPI1TCNTH SPI1TCNTH
extern volatile unsigned char           SPI1TCNTH           __at(0x3D13);
#ifndef _LIB_BUILD
asm("SPI1TCNTH equ 03D13h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TCNTH                  :3;
    };
} SPI1TCNTHbits_t;
extern volatile SPI1TCNTHbits_t SPI1TCNTHbits __at(0x3D13);
// bitfield macros
#define _SPI1TCNTH_TCNTH_POSN                               0x0
#define _SPI1TCNTH_TCNTH_POSITION                           0x0
#define _SPI1TCNTH_TCNTH_SIZE                               0x3
#define _SPI1TCNTH_TCNTH_LENGTH                             0x3
#define _SPI1TCNTH_TCNTH_MASK                               0x7

// Register: SPI1CON0
#define SPI1CON0 SPI1CON0
extern volatile unsigned char           SPI1CON0            __at(0x3D14);
#ifndef _LIB_BUILD
asm("SPI1CON0 equ 03D14h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BMODE                  :1;
        unsigned MST                    :1;
        unsigned LSBF                   :1;
        unsigned                        :4;
        unsigned EN                     :1;
    };
    struct {
        unsigned SPI1BMODE              :1;
        unsigned SPI1MST                :1;
        unsigned SPI1LSBF               :1;
        unsigned                        :4;
        unsigned SPI1SPIEN              :1;
    };
} SPI1CON0bits_t;
extern volatile SPI1CON0bits_t SPI1CON0bits __at(0x3D14);
// bitfield macros
#define _SPI1CON0_BMODE_POSN                                0x0
#define _SPI1CON0_BMODE_POSITION                            0x0
#define _SPI1CON0_BMODE_SIZE                                0x1
#define _SPI1CON0_BMODE_LENGTH                              0x1
#define _SPI1CON0_BMODE_MASK                                0x1
#define _SPI1CON0_MST_POSN                                  0x1
#define _SPI1CON0_MST_POSITION                              0x1
#define _SPI1CON0_MST_SIZE                                  0x1
#define _SPI1CON0_MST_LENGTH                                0x1
#define _SPI1CON0_MST_MASK                                  0x2
#define _SPI1CON0_LSBF_POSN                                 0x2
#define _SPI1CON0_LSBF_POSITION                             0x2
#define _SPI1CON0_LSBF_SIZE                                 0x1
#define _SPI1CON0_LSBF_LENGTH                               0x1
#define _SPI1CON0_LSBF_MASK                                 0x4
#define _SPI1CON0_EN_POSN                                   0x7
#define _SPI1CON0_EN_POSITION                               0x7
#define _SPI1CON0_EN_SIZE                                   0x1
#define _SPI1CON0_EN_LENGTH                                 0x1
#define _SPI1CON0_EN_MASK                                   0x80
#define _SPI1CON0_SPI1BMODE_POSN                            0x0
#define _SPI1CON0_SPI1BMODE_POSITION                        0x0
#define _SPI1CON0_SPI1BMODE_SIZE                            0x1
#define _SPI1CON0_SPI1BMODE_LENGTH                          0x1
#define _SPI1CON0_SPI1BMODE_MASK                            0x1
#define _SPI1CON0_SPI1MST_POSN                              0x1
#define _SPI1CON0_SPI1MST_POSITION                          0x1
#define _SPI1CON0_SPI1MST_SIZE                              0x1
#define _SPI1CON0_SPI1MST_LENGTH                            0x1
#define _SPI1CON0_SPI1MST_MASK                              0x2
#define _SPI1CON0_SPI1LSBF_POSN                             0x2
#define _SPI1CON0_SPI1LSBF_POSITION                         0x2
#define _SPI1CON0_SPI1LSBF_SIZE                             0x1
#define _SPI1CON0_SPI1LSBF_LENGTH                           0x1
#define _SPI1CON0_SPI1LSBF_MASK                             0x4
#define _SPI1CON0_SPI1SPIEN_POSN                            0x7
#define _SPI1CON0_SPI1SPIEN_POSITION                        0x7
#define _SPI1CON0_SPI1SPIEN_SIZE                            0x1
#define _SPI1CON0_SPI1SPIEN_LENGTH                          0x1
#define _SPI1CON0_SPI1SPIEN_MASK                            0x80

// Register: SPI1CON1
#define SPI1CON1 SPI1CON1
extern volatile unsigned char           SPI1CON1            __at(0x3D15);
#ifndef _LIB_BUILD
asm("SPI1CON1 equ 03D15h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SDOP                   :1;
        unsigned SDIP                   :1;
        unsigned SSP                    :1;
        unsigned                        :1;
        unsigned FST                    :1;
        unsigned CKP                    :1;
        unsigned CKE                    :1;
        unsigned SMP                    :1;
    };
    struct {
        unsigned SPI1SDOP               :1;
        unsigned SPI1SDIP               :1;
        unsigned SPI1SSP                :1;
        unsigned                        :1;
        unsigned SPI1FST                :1;
        unsigned SPI1CKP                :1;
        unsigned SPI1CKE                :1;
        unsigned SPI1SMP                :1;
    };
} SPI1CON1bits_t;
extern volatile SPI1CON1bits_t SPI1CON1bits __at(0x3D15);
// bitfield macros
#define _SPI1CON1_SDOP_POSN                                 0x0
#define _SPI1CON1_SDOP_POSITION                             0x0
#define _SPI1CON1_SDOP_SIZE                                 0x1
#define _SPI1CON1_SDOP_LENGTH                               0x1
#define _SPI1CON1_SDOP_MASK                                 0x1
#define _SPI1CON1_SDIP_POSN                                 0x1
#define _SPI1CON1_SDIP_POSITION                             0x1
#define _SPI1CON1_SDIP_SIZE                                 0x1
#define _SPI1CON1_SDIP_LENGTH                               0x1
#define _SPI1CON1_SDIP_MASK                                 0x2
#define _SPI1CON1_SSP_POSN                                  0x2
#define _SPI1CON1_SSP_POSITION                              0x2
#define _SPI1CON1_SSP_SIZE                                  0x1
#define _SPI1CON1_SSP_LENGTH                                0x1
#define _SPI1CON1_SSP_MASK                                  0x4
#define _SPI1CON1_FST_POSN                                  0x4
#define _SPI1CON1_FST_POSITION                              0x4
#define _SPI1CON1_FST_SIZE                                  0x1
#define _SPI1CON1_FST_LENGTH                                0x1
#define _SPI1CON1_FST_MASK                                  0x10
#define _SPI1CON1_CKP_POSN                                  0x5
#define _SPI1CON1_CKP_POSITION                              0x5
#define _SPI1CON1_CKP_SIZE                                  0x1
#define _SPI1CON1_CKP_LENGTH                                0x1
#define _SPI1CON1_CKP_MASK                                  0x20
#define _SPI1CON1_CKE_POSN                                  0x6
#define _SPI1CON1_CKE_POSITION                              0x6
#define _SPI1CON1_CKE_SIZE                                  0x1
#define _SPI1CON1_CKE_LENGTH                                0x1
#define _SPI1CON1_CKE_MASK                                  0x40
#define _SPI1CON1_SMP_POSN                                  0x7
#define _SPI1CON1_SMP_POSITION                              0x7
#define _SPI1CON1_SMP_SIZE                                  0x1
#define _SPI1CON1_SMP_LENGTH                                0x1
#define _SPI1CON1_SMP_MASK                                  0x80
#define _SPI1CON1_SPI1SDOP_POSN                             0x0
#define _SPI1CON1_SPI1SDOP_POSITION                         0x0
#define _SPI1CON1_SPI1SDOP_SIZE                             0x1
#define _SPI1CON1_SPI1SDOP_LENGTH                           0x1
#define _SPI1CON1_SPI1SDOP_MASK                             0x1
#define _SPI1CON1_SPI1SDIP_POSN                             0x1
#define _SPI1CON1_SPI1SDIP_POSITION                         0x1
#define _SPI1CON1_SPI1SDIP_SIZE                             0x1
#define _SPI1CON1_SPI1SDIP_LENGTH                           0x1
#define _SPI1CON1_SPI1SDIP_MASK                             0x2
#define _SPI1CON1_SPI1SSP_POSN                              0x2
#define _SPI1CON1_SPI1SSP_POSITION                          0x2
#define _SPI1CON1_SPI1SSP_SIZE                              0x1
#define _SPI1CON1_SPI1SSP_LENGTH                            0x1
#define _SPI1CON1_SPI1SSP_MASK                              0x4
#define _SPI1CON1_SPI1FST_POSN                              0x4
#define _SPI1CON1_SPI1FST_POSITION                          0x4
#define _SPI1CON1_SPI1FST_SIZE                              0x1
#define _SPI1CON1_SPI1FST_LENGTH                            0x1
#define _SPI1CON1_SPI1FST_MASK                              0x10
#define _SPI1CON1_SPI1CKP_POSN                              0x5
#define _SPI1CON1_SPI1CKP_POSITION                          0x5
#define _SPI1CON1_SPI1CKP_SIZE                              0x1
#define _SPI1CON1_SPI1CKP_LENGTH                            0x1
#define _SPI1CON1_SPI1CKP_MASK                              0x20
#define _SPI1CON1_SPI1CKE_POSN                              0x6
#define _SPI1CON1_SPI1CKE_POSITION                          0x6
#define _SPI1CON1_SPI1CKE_SIZE                              0x1
#define _SPI1CON1_SPI1CKE_LENGTH                            0x1
#define _SPI1CON1_SPI1CKE_MASK                              0x40
#define _SPI1CON1_SPI1SMP_POSN                              0x7
#define _SPI1CON1_SPI1SMP_POSITION                          0x7
#define _SPI1CON1_SPI1SMP_SIZE                              0x1
#define _SPI1CON1_SPI1SMP_LENGTH                            0x1
#define _SPI1CON1_SPI1SMP_MASK                              0x80

// Register: SPI1CON2
#define SPI1CON2 SPI1CON2
extern volatile unsigned char           SPI1CON2            __at(0x3D16);
#ifndef _LIB_BUILD
asm("SPI1CON2 equ 03D16h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXR                    :1;
        unsigned TXR                    :1;
        unsigned SSET                   :1;
        unsigned                        :3;
        unsigned SSFLT                  :1;
        unsigned BUSY                   :1;
    };
    struct {
        unsigned SPI1RXR                :1;
        unsigned SPI1TXR                :1;
        unsigned SPI1SSET               :1;
        unsigned                        :3;
        unsigned SPI1SSFLT              :1;
        unsigned SPI1BUSY               :1;
    };
} SPI1CON2bits_t;
