MikroElektronika/core_packages/PIC/XC8/def/PIC18LF47K42/mcu.h
// Register: I2C1STAT1
#define I2C1STAT1 I2C1STAT1
extern volatile unsigned char           I2C1STAT1           __at(0x3D78);
#ifndef _LIB_BUILD
asm("I2C1STAT1 equ 03D78h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXBF                   :1;
        unsigned                        :1;
        unsigned CLRBF                  :1;
        unsigned RXRE                   :1;
        unsigned                        :1;
        unsigned TXBE                   :1;
        unsigned                        :1;
        unsigned TXWE                   :1;
    };
} I2C1STAT1bits_t;
extern volatile I2C1STAT1bits_t I2C1STAT1bits __at(0x3D78);
// bitfield macros
#define _I2C1STAT1_RXBF_POSN                                0x0
#define _I2C1STAT1_RXBF_POSITION                            0x0
#define _I2C1STAT1_RXBF_SIZE                                0x1
#define _I2C1STAT1_RXBF_LENGTH                              0x1
#define _I2C1STAT1_RXBF_MASK                                0x1
#define _I2C1STAT1_CLRBF_POSN                               0x2
#define _I2C1STAT1_CLRBF_POSITION                           0x2
#define _I2C1STAT1_CLRBF_SIZE                               0x1
#define _I2C1STAT1_CLRBF_LENGTH                             0x1
#define _I2C1STAT1_CLRBF_MASK                               0x4
#define _I2C1STAT1_RXRE_POSN                                0x3
#define _I2C1STAT1_RXRE_POSITION                            0x3
#define _I2C1STAT1_RXRE_SIZE                                0x1
#define _I2C1STAT1_RXRE_LENGTH                              0x1
#define _I2C1STAT1_RXRE_MASK                                0x8
#define _I2C1STAT1_TXBE_POSN                                0x5
#define _I2C1STAT1_TXBE_POSITION                            0x5
#define _I2C1STAT1_TXBE_SIZE                                0x1
#define _I2C1STAT1_TXBE_LENGTH                              0x1
#define _I2C1STAT1_TXBE_MASK                                0x20
#define _I2C1STAT1_TXWE_POSN                                0x7
#define _I2C1STAT1_TXWE_POSITION                            0x7
#define _I2C1STAT1_TXWE_SIZE                                0x1
#define _I2C1STAT1_TXWE_LENGTH                              0x1
#define _I2C1STAT1_TXWE_MASK                                0x80

// Register: I2C1PIR
#define I2C1PIR I2C1PIR
extern volatile unsigned char           I2C1PIR             __at(0x3D79);
#ifndef _LIB_BUILD
asm("I2C1PIR equ 03D79h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SCIF                   :1;
        unsigned RSCIF                  :1;
        unsigned PCIF                   :1;
        unsigned ADRIF                  :1;
        unsigned WRIF                   :1;
        unsigned                        :1;
        unsigned ACKTIF                 :1;
        unsigned CNTIF                  :1;
    };
    struct {
        unsigned SC1IF                  :1;
        unsigned RSC1IF                 :1;
        unsigned PC1IF                  :1;
        unsigned ADR1IF                 :1;
        unsigned WR1IF                  :1;
        unsigned                        :1;
        unsigned ACKT1IF                :1;
        unsigned CNT1IF                 :1;
    };
} I2C1PIRbits_t;
extern volatile I2C1PIRbits_t I2C1PIRbits __at(0x3D79);
// bitfield macros
#define _I2C1PIR_SCIF_POSN                                  0x0
#define _I2C1PIR_SCIF_POSITION                              0x0
#define _I2C1PIR_SCIF_SIZE                                  0x1
#define _I2C1PIR_SCIF_LENGTH                                0x1
#define _I2C1PIR_SCIF_MASK                                  0x1
#define _I2C1PIR_RSCIF_POSN                                 0x1
#define _I2C1PIR_RSCIF_POSITION                             0x1
#define _I2C1PIR_RSCIF_SIZE                                 0x1
#define _I2C1PIR_RSCIF_LENGTH                               0x1
#define _I2C1PIR_RSCIF_MASK                                 0x2
#define _I2C1PIR_PCIF_POSN                                  0x2
#define _I2C1PIR_PCIF_POSITION                              0x2
#define _I2C1PIR_PCIF_SIZE                                  0x1
#define _I2C1PIR_PCIF_LENGTH                                0x1
#define _I2C1PIR_PCIF_MASK                                  0x4
#define _I2C1PIR_ADRIF_POSN                                 0x3
#define _I2C1PIR_ADRIF_POSITION                             0x3
#define _I2C1PIR_ADRIF_SIZE                                 0x1
#define _I2C1PIR_ADRIF_LENGTH                               0x1
#define _I2C1PIR_ADRIF_MASK                                 0x8
#define _I2C1PIR_WRIF_POSN                                  0x4
#define _I2C1PIR_WRIF_POSITION                              0x4
#define _I2C1PIR_WRIF_SIZE                                  0x1
#define _I2C1PIR_WRIF_LENGTH                                0x1
#define _I2C1PIR_WRIF_MASK                                  0x10
#define _I2C1PIR_ACKTIF_POSN                                0x6
#define _I2C1PIR_ACKTIF_POSITION                            0x6
#define _I2C1PIR_ACKTIF_SIZE                                0x1
#define _I2C1PIR_ACKTIF_LENGTH                              0x1
#define _I2C1PIR_ACKTIF_MASK                                0x40
#define _I2C1PIR_CNTIF_POSN                                 0x7
#define _I2C1PIR_CNTIF_POSITION                             0x7
#define _I2C1PIR_CNTIF_SIZE                                 0x1
#define _I2C1PIR_CNTIF_LENGTH                               0x1
#define _I2C1PIR_CNTIF_MASK                                 0x80
#define _I2C1PIR_SC1IF_POSN                                 0x0
#define _I2C1PIR_SC1IF_POSITION                             0x0
#define _I2C1PIR_SC1IF_SIZE                                 0x1
#define _I2C1PIR_SC1IF_LENGTH                               0x1
#define _I2C1PIR_SC1IF_MASK                                 0x1
#define _I2C1PIR_RSC1IF_POSN                                0x1
#define _I2C1PIR_RSC1IF_POSITION                            0x1
#define _I2C1PIR_RSC1IF_SIZE                                0x1
#define _I2C1PIR_RSC1IF_LENGTH                              0x1
#define _I2C1PIR_RSC1IF_MASK                                0x2
#define _I2C1PIR_PC1IF_POSN                                 0x2
#define _I2C1PIR_PC1IF_POSITION                             0x2
#define _I2C1PIR_PC1IF_SIZE                                 0x1
#define _I2C1PIR_PC1IF_LENGTH                               0x1
#define _I2C1PIR_PC1IF_MASK                                 0x4
#define _I2C1PIR_ADR1IF_POSN                                0x3
#define _I2C1PIR_ADR1IF_POSITION                            0x3
#define _I2C1PIR_ADR1IF_SIZE                                0x1
#define _I2C1PIR_ADR1IF_LENGTH                              0x1
#define _I2C1PIR_ADR1IF_MASK                                0x8
#define _I2C1PIR_WR1IF_POSN                                 0x4
#define _I2C1PIR_WR1IF_POSITION                             0x4
#define _I2C1PIR_WR1IF_SIZE                                 0x1
#define _I2C1PIR_WR1IF_LENGTH                               0x1
#define _I2C1PIR_WR1IF_MASK                                 0x10
#define _I2C1PIR_ACKT1IF_POSN                               0x6
#define _I2C1PIR_ACKT1IF_POSITION                           0x6
#define _I2C1PIR_ACKT1IF_SIZE                               0x1
#define _I2C1PIR_ACKT1IF_LENGTH                             0x1
#define _I2C1PIR_ACKT1IF_MASK                               0x40
#define _I2C1PIR_CNT1IF_POSN                                0x7
#define _I2C1PIR_CNT1IF_POSITION                            0x7
#define _I2C1PIR_CNT1IF_SIZE                                0x1
#define _I2C1PIR_CNT1IF_LENGTH                              0x1
#define _I2C1PIR_CNT1IF_MASK                                0x80

