MikroElektronika/core_packages/PIC/XC8/def/PIC18LF47K42/mcu.h
// Register: CWG3CON0
#define CWG3CON0 CWG3CON0
extern volatile unsigned char           CWG3CON0            __at(0x3F44);
#ifndef _LIB_BUILD
asm("CWG3CON0 equ 03F44h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MODE                   :3;
        unsigned                        :3;
        unsigned LD                     :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
        unsigned MODE2                  :1;
        unsigned                        :4;
        unsigned G3EN                   :1;
    };
    struct {
        unsigned CWG3MODE               :3;
        unsigned                        :3;
        unsigned CWG3LD                 :1;
        unsigned CWG3EN                 :1;
    };
    struct {
        unsigned CWG3MODE0              :1;
        unsigned CWG3MODE1              :1;
        unsigned CWG3MODE2              :1;
    };
} CWG3CON0bits_t;
extern volatile CWG3CON0bits_t CWG3CON0bits __at(0x3F44);
// bitfield macros
#define _CWG3CON0_MODE_POSN                                 0x0
#define _CWG3CON0_MODE_POSITION                             0x0
#define _CWG3CON0_MODE_SIZE                                 0x3
#define _CWG3CON0_MODE_LENGTH                               0x3
#define _CWG3CON0_MODE_MASK                                 0x7
#define _CWG3CON0_LD_POSN                                   0x6
#define _CWG3CON0_LD_POSITION                               0x6
#define _CWG3CON0_LD_SIZE                                   0x1
#define _CWG3CON0_LD_LENGTH                                 0x1
#define _CWG3CON0_LD_MASK                                   0x40
#define _CWG3CON0_EN_POSN                                   0x7
#define _CWG3CON0_EN_POSITION                               0x7
#define _CWG3CON0_EN_SIZE                                   0x1
#define _CWG3CON0_EN_LENGTH                                 0x1
#define _CWG3CON0_EN_MASK                                   0x80
#define _CWG3CON0_MODE0_POSN                                0x0
#define _CWG3CON0_MODE0_POSITION                            0x0
#define _CWG3CON0_MODE0_SIZE                                0x1
#define _CWG3CON0_MODE0_LENGTH                              0x1
#define _CWG3CON0_MODE0_MASK                                0x1
#define _CWG3CON0_MODE1_POSN                                0x1
#define _CWG3CON0_MODE1_POSITION                            0x1
#define _CWG3CON0_MODE1_SIZE                                0x1
#define _CWG3CON0_MODE1_LENGTH                              0x1
#define _CWG3CON0_MODE1_MASK                                0x2
#define _CWG3CON0_MODE2_POSN                                0x2
#define _CWG3CON0_MODE2_POSITION                            0x2
#define _CWG3CON0_MODE2_SIZE                                0x1
#define _CWG3CON0_MODE2_LENGTH                              0x1
#define _CWG3CON0_MODE2_MASK                                0x4
#define _CWG3CON0_G3EN_POSN                                 0x7
#define _CWG3CON0_G3EN_POSITION                             0x7
#define _CWG3CON0_G3EN_SIZE                                 0x1
#define _CWG3CON0_G3EN_LENGTH                               0x1
#define _CWG3CON0_G3EN_MASK                                 0x80
#define _CWG3CON0_CWG3MODE_POSN                             0x0
#define _CWG3CON0_CWG3MODE_POSITION                         0x0
#define _CWG3CON0_CWG3MODE_SIZE                             0x3
#define _CWG3CON0_CWG3MODE_LENGTH                           0x3
#define _CWG3CON0_CWG3MODE_MASK                             0x7
#define _CWG3CON0_CWG3LD_POSN                               0x6
#define _CWG3CON0_CWG3LD_POSITION                           0x6
#define _CWG3CON0_CWG3LD_SIZE                               0x1
#define _CWG3CON0_CWG3LD_LENGTH                             0x1
#define _CWG3CON0_CWG3LD_MASK                               0x40
#define _CWG3CON0_CWG3EN_POSN                               0x7
#define _CWG3CON0_CWG3EN_POSITION                           0x7
#define _CWG3CON0_CWG3EN_SIZE                               0x1
#define _CWG3CON0_CWG3EN_LENGTH                             0x1
#define _CWG3CON0_CWG3EN_MASK                               0x80
#define _CWG3CON0_CWG3MODE0_POSN                            0x0
#define _CWG3CON0_CWG3MODE0_POSITION                        0x0
#define _CWG3CON0_CWG3MODE0_SIZE                            0x1
#define _CWG3CON0_CWG3MODE0_LENGTH                          0x1
#define _CWG3CON0_CWG3MODE0_MASK                            0x1
#define _CWG3CON0_CWG3MODE1_POSN                            0x1
#define _CWG3CON0_CWG3MODE1_POSITION                        0x1
#define _CWG3CON0_CWG3MODE1_SIZE                            0x1
#define _CWG3CON0_CWG3MODE1_LENGTH                          0x1
#define _CWG3CON0_CWG3MODE1_MASK                            0x2
#define _CWG3CON0_CWG3MODE2_POSN                            0x2
#define _CWG3CON0_CWG3MODE2_POSITION                        0x2
#define _CWG3CON0_CWG3MODE2_SIZE                            0x1
#define _CWG3CON0_CWG3MODE2_LENGTH                          0x1
#define _CWG3CON0_CWG3MODE2_MASK                            0x4

// Register: CWG3CON1
#define CWG3CON1 CWG3CON1
extern volatile unsigned char           CWG3CON1            __at(0x3F45);
#ifndef _LIB_BUILD
asm("CWG3CON1 equ 03F45h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned POLA                   :1;
        unsigned POLB                   :1;
        unsigned POLC                   :1;
        unsigned POLD                   :1;
        unsigned                        :1;
        unsigned IN                     :1;
    };
    struct {
        unsigned CWG3POLA               :1;
        unsigned CWG3POLB               :1;
        unsigned CWG3POLC               :1;
        unsigned CWG3POLD               :1;
        unsigned                        :1;
        unsigned CWG3IN                 :1;
    };
} CWG3CON1bits_t;
extern volatile CWG3CON1bits_t CWG3CON1bits __at(0x3F45);
// bitfield macros
#define _CWG3CON1_POLA_POSN                                 0x0
#define _CWG3CON1_POLA_POSITION                             0x0
#define _CWG3CON1_POLA_SIZE                                 0x1
#define _CWG3CON1_POLA_LENGTH                               0x1
#define _CWG3CON1_POLA_MASK                                 0x1
#define _CWG3CON1_POLB_POSN                                 0x1
#define _CWG3CON1_POLB_POSITION                             0x1
#define _CWG3CON1_POLB_SIZE                                 0x1
#define _CWG3CON1_POLB_LENGTH                               0x1
#define _CWG3CON1_POLB_MASK                                 0x2
#define _CWG3CON1_POLC_POSN                                 0x2
#define _CWG3CON1_POLC_POSITION                             0x2
#define _CWG3CON1_POLC_SIZE                                 0x1
#define _CWG3CON1_POLC_LENGTH                               0x1
#define _CWG3CON1_POLC_MASK                                 0x4
#define _CWG3CON1_POLD_POSN                                 0x3
#define _CWG3CON1_POLD_POSITION                             0x3
#define _CWG3CON1_POLD_SIZE                                 0x1
#define _CWG3CON1_POLD_LENGTH                               0x1
#define _CWG3CON1_POLD_MASK                                 0x8
#define _CWG3CON1_IN_POSN                                   0x5
#define _CWG3CON1_IN_POSITION                               0x5
#define _CWG3CON1_IN_SIZE                                   0x1
#define _CWG3CON1_IN_LENGTH                                 0x1
#define _CWG3CON1_IN_MASK                                   0x20
#define _CWG3CON1_CWG3POLA_POSN                             0x0
#define _CWG3CON1_CWG3POLA_POSITION                         0x0
#define _CWG3CON1_CWG3POLA_SIZE                             0x1
#define _CWG3CON1_CWG3POLA_LENGTH                           0x1
#define _CWG3CON1_CWG3POLA_MASK                             0x1
#define _CWG3CON1_CWG3POLB_POSN                             0x1
#define _CWG3CON1_CWG3POLB_POSITION                         0x1
#define _CWG3CON1_CWG3POLB_SIZE                             0x1
#define _CWG3CON1_CWG3POLB_LENGTH                           0x1
#define _CWG3CON1_CWG3POLB_MASK                             0x2
#define _CWG3CON1_CWG3POLC_POSN                             0x2
#define _CWG3CON1_CWG3POLC_POSITION                         0x2
#define _CWG3CON1_CWG3POLC_SIZE                             0x1
#define _CWG3CON1_CWG3POLC_LENGTH                           0x1
#define _CWG3CON1_CWG3POLC_MASK                             0x4
#define _CWG3CON1_CWG3POLD_POSN                             0x3
#define _CWG3CON1_CWG3POLD_POSITION                         0x3
#define _CWG3CON1_CWG3POLD_SIZE                             0x1
#define _CWG3CON1_CWG3POLD_LENGTH                           0x1
#define _CWG3CON1_CWG3POLD_MASK                             0x8
#define _CWG3CON1_CWG3IN_POSN                               0x5
#define _CWG3CON1_CWG3IN_POSITION                           0x5
#define _CWG3CON1_CWG3IN_SIZE                               0x1
#define _CWG3CON1_CWG3IN_LENGTH                             0x1
#define _CWG3CON1_CWG3IN_MASK                               0x20

// Register: CWG3AS0
#define CWG3AS0 CWG3AS0
extern volatile unsigned char           CWG3AS0             __at(0x3F46);
#ifndef _LIB_BUILD
asm("CWG3AS0 equ 03F46h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned LSAC                   :2;
        unsigned LSDBD                  :2;
        unsigned REN                    :1;
        unsigned SHUTDOWN               :1;
    };
    struct {
        unsigned                        :2;
        unsigned LSAC0                  :1;
        unsigned LSCA1                  :1;
        unsigned LSDB0                  :1;
        unsigned LSDB1                  :1;
    };
    struct {
        unsigned                        :2;
        unsigned CWG3LSAC0              :1;
        unsigned CWG3LSAC1              :1;
        unsigned CWG3LSDB0              :1;
        unsigned CWG3LSDB1              :1;
    };
    struct {
        unsigned                        :2;
        unsigned CWG3LSAC               :2;
        unsigned CWG3LSDB               :2;
    };
    struct {
        unsigned                        :4;
        unsigned LSBD                   :2;
    };
    struct {
        unsigned                        :3;
        unsigned LSAC1                  :1;
        unsigned LSBD0                  :1;
        unsigned LSBD1                  :1;
    };
    struct {
        unsigned                        :4;
        unsigned CWG3LSBD0              :1;
        unsigned CWG3LSBD1              :1;
    };
    struct {
        unsigned                        :4;
        unsigned CWG3LSBD               :2;
    };
} CWG3AS0bits_t;
extern volatile CWG3AS0bits_t CWG3AS0bits __at(0x3F46);
// bitfield macros
#define _CWG3AS0_LSAC_POSN                                  0x2
#define _CWG3AS0_LSAC_POSITION                              0x2
#define _CWG3AS0_LSAC_SIZE                                  0x2
#define _CWG3AS0_LSAC_LENGTH                                0x2
#define _CWG3AS0_LSAC_MASK                                  0xC
#define _CWG3AS0_LSDBD_POSN                                 0x4
#define _CWG3AS0_LSDBD_POSITION                             0x4
#define _CWG3AS0_LSDBD_SIZE                                 0x2
#define _CWG3AS0_LSDBD_LENGTH                               0x2
#define _CWG3AS0_LSDBD_MASK                                 0x30
#define _CWG3AS0_REN_POSN                                   0x6
#define _CWG3AS0_REN_POSITION                               0x6
#define _CWG3AS0_REN_SIZE                                   0x1
#define _CWG3AS0_REN_LENGTH                                 0x1
#define _CWG3AS0_REN_MASK                                   0x40
#define _CWG3AS0_SHUTDOWN_POSN                              0x7
#define _CWG3AS0_SHUTDOWN_POSITION                          0x7
#define _CWG3AS0_SHUTDOWN_SIZE                              0x1
#define _CWG3AS0_SHUTDOWN_LENGTH                            0x1
#define _CWG3AS0_SHUTDOWN_MASK                              0x80
#define _CWG3AS0_LSAC0_POSN                                 0x2
#define _CWG3AS0_LSAC0_POSITION                             0x2
#define _CWG3AS0_LSAC0_SIZE                                 0x1
#define _CWG3AS0_LSAC0_LENGTH                               0x1
#define _CWG3AS0_LSAC0_MASK                                 0x4
#define _CWG3AS0_LSCA1_POSN                                 0x3
#define _CWG3AS0_LSCA1_POSITION                             0x3
#define _CWG3AS0_LSCA1_SIZE                                 0x1
#define _CWG3AS0_LSCA1_LENGTH                               0x1
#define _CWG3AS0_LSCA1_MASK                                 0x8
#define _CWG3AS0_LSDB0_POSN                                 0x4
#define _CWG3AS0_LSDB0_POSITION                             0x4
#define _CWG3AS0_LSDB0_SIZE                                 0x1
#define _CWG3AS0_LSDB0_LENGTH                               0x1
#define _CWG3AS0_LSDB0_MASK                                 0x10
#define _CWG3AS0_LSDB1_POSN                                 0x5
#define _CWG3AS0_LSDB1_POSITION                             0x5
#define _CWG3AS0_LSDB1_SIZE                                 0x1
#define _CWG3AS0_LSDB1_LENGTH                               0x1
#define _CWG3AS0_LSDB1_MASK                                 0x20
#define _CWG3AS0_CWG3LSAC0_POSN                             0x2
#define _CWG3AS0_CWG3LSAC0_POSITION                         0x2
#define _CWG3AS0_CWG3LSAC0_SIZE                             0x1
#define _CWG3AS0_CWG3LSAC0_LENGTH                           0x1
#define _CWG3AS0_CWG3LSAC0_MASK                             0x4
#define _CWG3AS0_CWG3LSAC1_POSN                             0x3
#define _CWG3AS0_CWG3LSAC1_POSITION                         0x3
#define _CWG3AS0_CWG3LSAC1_SIZE                             0x1
#define _CWG3AS0_CWG3LSAC1_LENGTH                           0x1
#define _CWG3AS0_CWG3LSAC1_MASK                             0x8
#define _CWG3AS0_CWG3LSDB0_POSN                             0x4
#define _CWG3AS0_CWG3LSDB0_POSITION                         0x4
#define _CWG3AS0_CWG3LSDB0_SIZE                             0x1
#define _CWG3AS0_CWG3LSDB0_LENGTH                           0x1
#define _CWG3AS0_CWG3LSDB0_MASK                             0x10
#define _CWG3AS0_CWG3LSDB1_POSN                             0x5
#define _CWG3AS0_CWG3LSDB1_POSITION                         0x5
#define _CWG3AS0_CWG3LSDB1_SIZE                             0x1
#define _CWG3AS0_CWG3LSDB1_LENGTH                           0x1
#define _CWG3AS0_CWG3LSDB1_MASK                             0x20
#define _CWG3AS0_CWG3LSAC_POSN                              0x2
#define _CWG3AS0_CWG3LSAC_POSITION                          0x2
#define _CWG3AS0_CWG3LSAC_SIZE                              0x2
#define _CWG3AS0_CWG3LSAC_LENGTH                            0x2
#define _CWG3AS0_CWG3LSAC_MASK                              0xC
#define _CWG3AS0_CWG3LSDB_POSN                              0x4
#define _CWG3AS0_CWG3LSDB_POSITION                          0x4
#define _CWG3AS0_CWG3LSDB_SIZE                              0x2
#define _CWG3AS0_CWG3LSDB_LENGTH                            0x2
#define _CWG3AS0_CWG3LSDB_MASK                              0x30
#define _CWG3AS0_LSBD_POSN                                  0x4
#define _CWG3AS0_LSBD_POSITION                              0x4
#define _CWG3AS0_LSBD_SIZE                                  0x2
#define _CWG3AS0_LSBD_LENGTH                                0x2
#define _CWG3AS0_LSBD_MASK                                  0x30
#define _CWG3AS0_LSAC1_POSN                                 0x3
#define _CWG3AS0_LSAC1_POSITION                             0x3
#define _CWG3AS0_LSAC1_SIZE                                 0x1
#define _CWG3AS0_LSAC1_LENGTH                               0x1
#define _CWG3AS0_LSAC1_MASK                                 0x8
#define _CWG3AS0_LSBD0_POSN                                 0x4
#define _CWG3AS0_LSBD0_POSITION                             0x4
#define _CWG3AS0_LSBD0_SIZE                                 0x1
#define _CWG3AS0_LSBD0_LENGTH                               0x1
#define _CWG3AS0_LSBD0_MASK                                 0x10
#define _CWG3AS0_LSBD1_POSN                                 0x5
#define _CWG3AS0_LSBD1_POSITION                             0x5
#define _CWG3AS0_LSBD1_SIZE                                 0x1
#define _CWG3AS0_LSBD1_LENGTH                               0x1
#define _CWG3AS0_LSBD1_MASK                                 0x20
#define _CWG3AS0_CWG3LSBD0_POSN                             0x4
#define _CWG3AS0_CWG3LSBD0_POSITION                         0x4
#define _CWG3AS0_CWG3LSBD0_SIZE                             0x1
#define _CWG3AS0_CWG3LSBD0_LENGTH                           0x1
#define _CWG3AS0_CWG3LSBD0_MASK                             0x10
#define _CWG3AS0_CWG3LSBD1_POSN                             0x5
#define _CWG3AS0_CWG3LSBD1_POSITION                         0x5
#define _CWG3AS0_CWG3LSBD1_SIZE                             0x1
#define _CWG3AS0_CWG3LSBD1_LENGTH                           0x1
#define _CWG3AS0_CWG3LSBD1_MASK                             0x20
#define _CWG3AS0_CWG3LSBD_POSN                              0x4
#define _CWG3AS0_CWG3LSBD_POSITION                          0x4
#define _CWG3AS0_CWG3LSBD_SIZE                              0x2
#define _CWG3AS0_CWG3LSBD_LENGTH                            0x2
#define _CWG3AS0_CWG3LSBD_MASK                              0x30

// Register: CWG3AS1
#define CWG3AS1 CWG3AS1
extern volatile unsigned char           CWG3AS1             __at(0x3F47);
#ifndef _LIB_BUILD
asm("CWG3AS1 equ 03F47h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned AS0E                   :1;
        unsigned AS1E                   :1;
        unsigned AS2E                   :1;
        unsigned AS3E                   :1;
        unsigned AS4E                   :1;
        unsigned AS5E                   :1;
        unsigned AS6E                   :1;
    };
} CWG3AS1bits_t;
extern volatile CWG3AS1bits_t CWG3AS1bits __at(0x3F47);
// bitfield macros
#define _CWG3AS1_AS0E_POSN                                  0x0
#define _CWG3AS1_AS0E_POSITION                              0x0
#define _CWG3AS1_AS0E_SIZE                                  0x1
#define _CWG3AS1_AS0E_LENGTH                                0x1
#define _CWG3AS1_AS0E_MASK                                  0x1
#define _CWG3AS1_AS1E_POSN                                  0x1
#define _CWG3AS1_AS1E_POSITION                              0x1
#define _CWG3AS1_AS1E_SIZE                                  0x1
#define _CWG3AS1_AS1E_LENGTH                                0x1
#define _CWG3AS1_AS1E_MASK                                  0x2
#define _CWG3AS1_AS2E_POSN                                  0x2
#define _CWG3AS1_AS2E_POSITION                              0x2
#define _CWG3AS1_AS2E_SIZE                                  0x1
#define _CWG3AS1_AS2E_LENGTH                                0x1
#define _CWG3AS1_AS2E_MASK                                  0x4
#define _CWG3AS1_AS3E_POSN                                  0x3
#define _CWG3AS1_AS3E_POSITION                              0x3
#define _CWG3AS1_AS3E_SIZE                                  0x1
#define _CWG3AS1_AS3E_LENGTH                                0x1
#define _CWG3AS1_AS3E_MASK                                  0x8
#define _CWG3AS1_AS4E_POSN                                  0x4
#define _CWG3AS1_AS4E_POSITION                              0x4
#define _CWG3AS1_AS4E_SIZE                                  0x1
#define _CWG3AS1_AS4E_LENGTH                                0x1
#define _CWG3AS1_AS4E_MASK                                  0x10
#define _CWG3AS1_AS5E_POSN                                  0x5
#define _CWG3AS1_AS5E_POSITION                              0x5
#define _CWG3AS1_AS5E_SIZE                                  0x1
#define _CWG3AS1_AS5E_LENGTH                                0x1
#define _CWG3AS1_AS5E_MASK                                  0x20
#define _CWG3AS1_AS6E_POSN                                  0x6
#define _CWG3AS1_AS6E_POSITION                              0x6
#define _CWG3AS1_AS6E_SIZE                                  0x1
#define _CWG3AS1_AS6E_LENGTH                                0x1
#define _CWG3AS1_AS6E_MASK                                  0x40

// Register: CWG3STR
#define CWG3STR CWG3STR
extern volatile unsigned char           CWG3STR             __at(0x3F48);
#ifndef _LIB_BUILD
asm("CWG3STR equ 03F48h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned STRA                   :1;
        unsigned STRB                   :1;
        unsigned STRC                   :1;
        unsigned STRD                   :1;
        unsigned OVRA                   :1;
        unsigned OVRB                   :1;
        unsigned OVRC                   :1;
        unsigned OVRD                   :1;
    };
    struct {
        unsigned CWG3STRA               :1;
        unsigned CWG3STRB               :1;
        unsigned CWG3STRC               :1;
        unsigned CWG3STRD               :1;
        unsigned CWG3OVRA               :1;
        unsigned CWG3OVRB               :1;
        unsigned CWG3OVRC               :1;
        unsigned CWG3OVRD               :1;
    };
} CWG3STRbits_t;
