MikroElektronika/core_packages/PIC/XC8/def/PIC18LF47K42/mcu.h
// ADFLTRH<FLTR11>
extern volatile __bit                   FLTR11              __at(0x1F73B);	// @ (0x3EE7 * 8 + 3)
#define                                 FLTR11_bit          _BIT_ACCESS(ADFLTRH,3)
// ADFLTRH<FLTR12>
extern volatile __bit                   FLTR12              __at(0x1F73C);	// @ (0x3EE7 * 8 + 4)
#define                                 FLTR12_bit          _BIT_ACCESS(ADFLTRH,4)
// ADFLTRH<FLTR13>
extern volatile __bit                   FLTR13              __at(0x1F73D);	// @ (0x3EE7 * 8 + 5)
#define                                 FLTR13_bit          _BIT_ACCESS(ADFLTRH,5)
// ADFLTRH<FLTR14>
extern volatile __bit                   FLTR14              __at(0x1F73E);	// @ (0x3EE7 * 8 + 6)
#define                                 FLTR14_bit          _BIT_ACCESS(ADFLTRH,6)
// ADFLTRH<FLTR15>
extern volatile __bit                   FLTR15              __at(0x1F73F);	// @ (0x3EE7 * 8 + 7)
#define                                 FLTR15_bit          _BIT_ACCESS(ADFLTRH,7)
// ADFLTRL<FLTR2>
extern volatile __bit                   FLTR2               __at(0x1F732);	// @ (0x3EE6 * 8 + 2)
#define                                 FLTR2_bit           _BIT_ACCESS(ADFLTRL,2)
// ADFLTRL<FLTR3>
extern volatile __bit                   FLTR3               __at(0x1F733);	// @ (0x3EE6 * 8 + 3)
#define                                 FLTR3_bit           _BIT_ACCESS(ADFLTRL,3)
// ADFLTRL<FLTR4>
extern volatile __bit                   FLTR4               __at(0x1F734);	// @ (0x3EE6 * 8 + 4)
#define                                 FLTR4_bit           _BIT_ACCESS(ADFLTRL,4)
// ADFLTRL<FLTR5>
extern volatile __bit                   FLTR5               __at(0x1F735);	// @ (0x3EE6 * 8 + 5)
#define                                 FLTR5_bit           _BIT_ACCESS(ADFLTRL,5)
// ADFLTRL<FLTR6>
extern volatile __bit                   FLTR6               __at(0x1F736);	// @ (0x3EE6 * 8 + 6)
#define                                 FLTR6_bit           _BIT_ACCESS(ADFLTRL,6)
// ADFLTRL<FLTR7>
extern volatile __bit                   FLTR7               __at(0x1F737);	// @ (0x3EE6 * 8 + 7)
#define                                 FLTR7_bit           _BIT_ACCESS(ADFLTRL,7)
// ADFLTRH<FLTR8>
extern volatile __bit                   FLTR8               __at(0x1F738);	// @ (0x3EE7 * 8 + 0)
#define                                 FLTR8_bit           _BIT_ACCESS(ADFLTRH,0)
// ADFLTRH<FLTR9>
extern volatile __bit                   FLTR9               __at(0x1F739);	// @ (0x3EE7 * 8 + 1)
#define                                 FLTR9_bit           _BIT_ACCESS(ADFLTRH,1)
// ADCON0<FM0>
extern volatile __bit                   FM0                 __at(0x1F7C2);	// @ (0x3EF8 * 8 + 2)
#define                                 FM0_bit             _BIT_ACCESS(ADCON0,2)
// NVMCON1<FREE>
extern volatile __bit                   FREE                __at(0x1CF2C);	// @ (0x39E5 * 8 + 4)
#define                                 FREE_bit            _BIT_ACCESS(NVMCON1,4)
// OSCFRQ<FRQ0>
extern volatile __bit                   FRQ0                __at(0x1CEF8);	// @ (0x39DF * 8 + 0)
#define                                 FRQ0_bit            _BIT_ACCESS(OSCFRQ,0)
// OSCFRQ<FRQ1>
extern volatile __bit                   FRQ1                __at(0x1CEF9);	// @ (0x39DF * 8 + 1)
#define                                 FRQ1_bit            _BIT_ACCESS(OSCFRQ,1)
// OSCFRQ<FRQ2>
extern volatile __bit                   FRQ2                __at(0x1CEFA);	// @ (0x39DF * 8 + 2)
#define                                 FRQ2_bit            _BIT_ACCESS(OSCFRQ,2)
// OSCFRQ<FRQ3>
extern volatile __bit                   FRQ3                __at(0x1CEFB);	// @ (0x39DF * 8 + 3)
#define                                 FRQ3_bit            _BIT_ACCESS(OSCFRQ,3)
// SPI1CON1<FST>
extern volatile __bit                   FST                 __at(0x1E8AC);	// @ (0x3D15 * 8 + 4)
#define                                 FST_bit             _BIT_ACCESS(SPI1CON1,4)
// CRCCON0<FULL>
extern volatile __bit                   FULL                __at(0x1CB40);	// @ (0x3968 * 8 + 0)
#define                                 FULL_bit            _BIT_ACCESS(CRCCON0,0)
// FVRCON<FVREN>
extern volatile __bit                   FVREN               __at(0x1F60F);	// @ (0x3EC1 * 8 + 7)
#define                                 FVREN_bit           _BIT_ACCESS(FVRCON,7)
// PMD0<FVRMD>
extern volatile __bit                   FVRMD               __at(0x1CE06);	// @ (0x39C0 * 8 + 6)
#define                                 FVRMD_bit           _BIT_ACCESS(PMD0,6)
// FVRCON<FVRRDY>
extern volatile __bit                   FVRRDY              __at(0x1F60E);	// @ (0x3EC1 * 8 + 6)
#define                                 FVRRDY_bit          _BIT_ACCESS(FVRCON,6)
// CWG1CON0<G1EN>
extern volatile __bit                   G1EN                __at(0x1FAB7);	// @ (0x3F56 * 8 + 7)
#define                                 G1EN_bit            _BIT_ACCESS(CWG1CON0,7)
// CWG2CON0<G2EN>
extern volatile __bit                   G2EN                __at(0x1FA6F);	// @ (0x3F4D * 8 + 7)
#define                                 G2EN_bit            _BIT_ACCESS(CWG2CON0,7)
// CWG3CON0<G3EN>
extern volatile __bit                   G3EN                __at(0x1FA27);	// @ (0x3F44 * 8 + 7)
#define                                 G3EN_bit            _BIT_ACCESS(CWG3CON0,7)
// INTCON0<GIE>
extern volatile __bit                   GIE                 __at(0x1FE97);	// @ (0x3FD2 * 8 + 7)
#define                                 GIE_bit             _BIT_ACCESS(INTCON0,7)
// INTCON0<GIEH>
extern volatile __bit                   GIEH                __at(0x1FE97);	// @ (0x3FD2 * 8 + 7)
#define                                 GIEH_bit            _BIT_ACCESS(INTCON0,7)
// INTCON0<GIEL>
extern volatile __bit                   GIEL                __at(0x1FE96);	// @ (0x3FD2 * 8 + 6)
#define                                 GIEL_bit            _BIT_ACCESS(INTCON0,6)
// ADCON0<GO_NOT_DONE>
extern volatile __bit                   GO_NOT_DONE         __at(0x1F7C0);	// @ (0x3EF8 * 8 + 0)
#define                                 GO_NOT_DONE_bit     _BIT_ACCESS(ADCON0,0)
// ADCON0<GO_nDONE>
extern volatile __bit                   GO_nDONE            __at(0x1F7C0);	// @ (0x3EF8 * 8 + 0)
#define                                 GO_nDONE_bit        _BIT_ACCESS(ADCON0,0)
// SCANHADRL<HADR0>
extern volatile __bit                   HADR0               __at(0x1CBC8);	// @ (0x3979 * 8 + 0)
#define                                 HADR0_bit           _BIT_ACCESS(SCANHADRL,0)
// SCANHADRL<HADR1>
extern volatile __bit                   HADR1               __at(0x1CBC9);	// @ (0x3979 * 8 + 1)
#define                                 HADR1_bit           _BIT_ACCESS(SCANHADRL,1)
// SCANHADRH<HADR10>
extern volatile __bit                   HADR10              __at(0x1CBD2);	// @ (0x397A * 8 + 2)
#define                                 HADR10_bit          _BIT_ACCESS(SCANHADRH,2)
// SCANHADRH<HADR11>
extern volatile __bit                   HADR11              __at(0x1CBD3);	// @ (0x397A * 8 + 3)
#define                                 HADR11_bit          _BIT_ACCESS(SCANHADRH,3)
// SCANHADRH<HADR12>
extern volatile __bit                   HADR12              __at(0x1CBD4);	// @ (0x397A * 8 + 4)
#define                                 HADR12_bit          _BIT_ACCESS(SCANHADRH,4)
// SCANHADRH<HADR13>
extern volatile __bit                   HADR13              __at(0x1CBD5);	// @ (0x397A * 8 + 5)
#define                                 HADR13_bit          _BIT_ACCESS(SCANHADRH,5)
// SCANHADRH<HADR14>
extern volatile __bit                   HADR14              __at(0x1CBD6);	// @ (0x397A * 8 + 6)
#define                                 HADR14_bit          _BIT_ACCESS(SCANHADRH,6)
// SCANHADRH<HADR15>
extern volatile __bit                   HADR15              __at(0x1CBD7);	// @ (0x397A * 8 + 7)
#define                                 HADR15_bit          _BIT_ACCESS(SCANHADRH,7)
// SCANHADRU<HADR16>
extern volatile __bit                   HADR16              __at(0x1CBD8);	// @ (0x397B * 8 + 0)
#define                                 HADR16_bit          _BIT_ACCESS(SCANHADRU,0)
// SCANHADRU<HADR17>
extern volatile __bit                   HADR17              __at(0x1CBD9);	// @ (0x397B * 8 + 1)
#define                                 HADR17_bit          _BIT_ACCESS(SCANHADRU,1)
// SCANHADRU<HADR18>
extern volatile __bit                   HADR18              __at(0x1CBDA);	// @ (0x397B * 8 + 2)
#define                                 HADR18_bit          _BIT_ACCESS(SCANHADRU,2)
// SCANHADRU<HADR19>
extern volatile __bit                   HADR19              __at(0x1CBDB);	// @ (0x397B * 8 + 3)
#define                                 HADR19_bit          _BIT_ACCESS(SCANHADRU,3)
// SCANHADRL<HADR2>
extern volatile __bit                   HADR2               __at(0x1CBCA);	// @ (0x3979 * 8 + 2)
#define                                 HADR2_bit           _BIT_ACCESS(SCANHADRL,2)
// SCANHADRU<HADR20>
extern volatile __bit                   HADR20              __at(0x1CBDC);	// @ (0x397B * 8 + 4)
#define                                 HADR20_bit          _BIT_ACCESS(SCANHADRU,4)
// SCANHADRU<HADR21>
extern volatile __bit                   HADR21              __at(0x1CBDD);	// @ (0x397B * 8 + 5)
#define                                 HADR21_bit          _BIT_ACCESS(SCANHADRU,5)
// SCANHADRL<HADR3>
extern volatile __bit                   HADR3               __at(0x1CBCB);	// @ (0x3979 * 8 + 3)
#define                                 HADR3_bit           _BIT_ACCESS(SCANHADRL,3)
// SCANHADRL<HADR4>
extern volatile __bit                   HADR4               __at(0x1CBCC);	// @ (0x3979 * 8 + 4)
#define                                 HADR4_bit           _BIT_ACCESS(SCANHADRL,4)
// SCANHADRL<HADR5>
extern volatile __bit                   HADR5               __at(0x1CBCD);	// @ (0x3979 * 8 + 5)
#define                                 HADR5_bit           _BIT_ACCESS(SCANHADRL,5)
// SCANHADRL<HADR6>
extern volatile __bit                   HADR6               __at(0x1CBCE);	// @ (0x3979 * 8 + 6)
#define                                 HADR6_bit           _BIT_ACCESS(SCANHADRL,6)
// SCANHADRL<HADR7>
extern volatile __bit                   HADR7               __at(0x1CBCF);	// @ (0x3979 * 8 + 7)
#define                                 HADR7_bit           _BIT_ACCESS(SCANHADRL,7)
// SCANHADRH<HADR8>
extern volatile __bit                   HADR8               __at(0x1CBD0);	// @ (0x397A * 8 + 0)
#define                                 HADR8_bit           _BIT_ACCESS(SCANHADRH,0)
// SCANHADRH<HADR9>
extern volatile __bit                   HADR9               __at(0x1CBD1);	// @ (0x397A * 8 + 1)
#define                                 HADR9_bit           _BIT_ACCESS(SCANHADRH,1)
// OSCFRQ<HFFRQ0>
extern volatile __bit                   HFFRQ0              __at(0x1CEF8);	// @ (0x39DF * 8 + 0)
#define                                 HFFRQ0_bit          _BIT_ACCESS(OSCFRQ,0)
// OSCFRQ<HFFRQ1>
extern volatile __bit                   HFFRQ1              __at(0x1CEF9);	// @ (0x39DF * 8 + 1)
#define                                 HFFRQ1_bit          _BIT_ACCESS(OSCFRQ,1)
// OSCFRQ<HFFRQ2>
extern volatile __bit                   HFFRQ2              __at(0x1CEFA);	// @ (0x39DF * 8 + 2)
#define                                 HFFRQ2_bit          _BIT_ACCESS(OSCFRQ,2)
// OSCFRQ<HFFRQ3>
extern volatile __bit                   HFFRQ3              __at(0x1CEFB);	// @ (0x39DF * 8 + 3)
#define                                 HFFRQ3_bit          _BIT_ACCESS(OSCFRQ,3)
// OSCEN<HFOEN>
extern volatile __bit                   HFOEN               __at(0x1CEEE);	// @ (0x39DD * 8 + 6)
#define                                 HFOEN_bit           _BIT_ACCESS(OSCEN,6)
// OSCSTAT<HFOR>
extern volatile __bit                   HFOR                __at(0x1CEE6);	// @ (0x39DC * 8 + 6)
#define                                 HFOR_bit            _BIT_ACCESS(OSCSTAT,6)
// OSCTUNE<HFTUN0>
extern volatile __bit                   HFTUN0              __at(0x1CEF0);	// @ (0x39DE * 8 + 0)
#define                                 HFTUN0_bit          _BIT_ACCESS(OSCTUNE,0)
// OSCTUNE<HFTUN1>
extern volatile __bit                   HFTUN1              __at(0x1CEF1);	// @ (0x39DE * 8 + 1)
#define                                 HFTUN1_bit          _BIT_ACCESS(OSCTUNE,1)
// OSCTUNE<HFTUN2>
extern volatile __bit                   HFTUN2              __at(0x1CEF2);	// @ (0x39DE * 8 + 2)
#define                                 HFTUN2_bit          _BIT_ACCESS(OSCTUNE,2)
// OSCTUNE<HFTUN3>
extern volatile __bit                   HFTUN3              __at(0x1CEF3);	// @ (0x39DE * 8 + 3)
#define                                 HFTUN3_bit          _BIT_ACCESS(OSCTUNE,3)
// OSCTUNE<HFTUN4>
extern volatile __bit                   HFTUN4              __at(0x1CEF4);	// @ (0x39DE * 8 + 4)
#define                                 HFTUN4_bit          _BIT_ACCESS(OSCTUNE,4)
// OSCTUNE<HFTUN5>
extern volatile __bit                   HFTUN5              __at(0x1CEF5);	// @ (0x39DE * 8 + 5)
#define                                 HFTUN5_bit          _BIT_ACCESS(OSCTUNE,5)
// HLVDCON0<HLVDEN>
extern volatile __bit                   HLVDEN              __at(0x1F64F);	// @ (0x3EC9 * 8 + 7)
#define                                 HLVDEN_bit          _BIT_ACCESS(HLVDCON0,7)
// PIE0<HLVDIE>
extern volatile __bit                   HLVDIE              __at(0x1CC81);	// @ (0x3990 * 8 + 1)
#define                                 HLVDIE_bit          _BIT_ACCESS(PIE0,1)
// PIR0<HLVDIF>
extern volatile __bit                   HLVDIF              __at(0x1CD01);	// @ (0x39A0 * 8 + 1)
#define                                 HLVDIF_bit          _BIT_ACCESS(PIR0,1)
// HLVDCON0<HLVDINTH>
extern volatile __bit                   HLVDINTH            __at(0x1F649);	// @ (0x3EC9 * 8 + 1)
#define                                 HLVDINTH_bit        _BIT_ACCESS(HLVDCON0,1)
// HLVDCON0<HLVDINTL>
extern volatile __bit                   HLVDINTL            __at(0x1F648);	// @ (0x3EC9 * 8 + 0)
#define                                 HLVDINTL_bit        _BIT_ACCESS(HLVDCON0,0)
// IPR0<HLVDIP>
extern volatile __bit                   HLVDIP              __at(0x1CC01);	// @ (0x3980 * 8 + 1)
#define                                 HLVDIP_bit          _BIT_ACCESS(IPR0,1)
// PMD0<HLVDMD>
extern volatile __bit                   HLVDMD              __at(0x1CE05);	// @ (0x39C0 * 8 + 5)
#define                                 HLVDMD_bit          _BIT_ACCESS(PMD0,5)
// HLVDCON0<HLVDOUT>
extern volatile __bit                   HLVDOUT             __at(0x1F64D);	// @ (0x3EC9 * 8 + 5)
#define                                 HLVDOUT_bit         _BIT_ACCESS(HLVDCON0,5)
// HLVDCON0<HLVDRDY>
extern volatile __bit                   HLVDRDY             __at(0x1F64C);	// @ (0x3EC9 * 8 + 4)
#define                                 HLVDRDY_bit         _BIT_ACCESS(HLVDCON0,4)
// HLVDCON1<HLVDSEL0>
extern volatile __bit                   HLVDSEL0            __at(0x1F650);	// @ (0x3ECA * 8 + 0)
#define                                 HLVDSEL0_bit        _BIT_ACCESS(HLVDCON1,0)
// HLVDCON1<HLVDSEL1>
extern volatile __bit                   HLVDSEL1            __at(0x1F651);	// @ (0x3ECA * 8 + 1)
#define                                 HLVDSEL1_bit        _BIT_ACCESS(HLVDCON1,1)
// HLVDCON1<HLVDSEL2>
extern volatile __bit                   HLVDSEL2            __at(0x1F652);	// @ (0x3ECA * 8 + 2)
#define                                 HLVDSEL2_bit        _BIT_ACCESS(HLVDCON1,2)
// HLVDCON1<HLVDSEL3>
extern volatile __bit                   HLVDSEL3            __at(0x1F653);	// @ (0x3ECA * 8 + 3)
#define                                 HLVDSEL3_bit        _BIT_ACCESS(HLVDCON1,3)
// PIE3<I2C1EIE>
extern volatile __bit                   I2C1EIE             __at(0x1CC9A);	// @ (0x3993 * 8 + 2)
#define                                 I2C1EIE_bit         _BIT_ACCESS(PIE3,2)
// PIR3<I2C1EIF>
extern volatile __bit                   I2C1EIF             __at(0x1CD1A);	// @ (0x39A3 * 8 + 2)
#define                                 I2C1EIF_bit         _BIT_ACCESS(PIR3,2)
// IPR3<I2C1EIP>
extern volatile __bit                   I2C1EIP             __at(0x1CC1A);	// @ (0x3983 * 8 + 2)
#define                                 I2C1EIP_bit         _BIT_ACCESS(IPR3,2)
// PIE3<I2C1IE>
extern volatile __bit                   I2C1IE              __at(0x1CC99);	// @ (0x3993 * 8 + 1)
#define                                 I2C1IE_bit          _BIT_ACCESS(PIE3,1)
// PIR3<I2C1IF>
extern volatile __bit                   I2C1IF              __at(0x1CD19);	// @ (0x39A3 * 8 + 1)
#define                                 I2C1IF_bit          _BIT_ACCESS(PIR3,1)
// IPR3<I2C1IP>
extern volatile __bit                   I2C1IP              __at(0x1CC19);	// @ (0x3983 * 8 + 1)
#define                                 I2C1IP_bit          _BIT_ACCESS(IPR3,1)
// PMD5<I2C1MD>
extern volatile __bit                   I2C1MD              __at(0x1CE28);	// @ (0x39C5 * 8 + 0)
#define                                 I2C1MD_bit          _BIT_ACCESS(PMD5,0)
// PIE2<I2C1RXIE>
extern volatile __bit                   I2C1RXIE            __at(0x1CC97);	// @ (0x3992 * 8 + 7)
#define                                 I2C1RXIE_bit        _BIT_ACCESS(PIE2,7)
// PIR2<I2C1RXIF>
extern volatile __bit                   I2C1RXIF            __at(0x1CD17);	// @ (0x39A2 * 8 + 7)
#define                                 I2C1RXIF_bit        _BIT_ACCESS(PIR2,7)
// IPR2<I2C1RXIP>
extern volatile __bit                   I2C1RXIP            __at(0x1CC17);	// @ (0x3982 * 8 + 7)
#define                                 I2C1RXIP_bit        _BIT_ACCESS(IPR2,7)
// PIE3<I2C1TXIE>
extern volatile __bit                   I2C1TXIE            __at(0x1CC98);	// @ (0x3993 * 8 + 0)
#define                                 I2C1TXIE_bit        _BIT_ACCESS(PIE3,0)
// PIR3<I2C1TXIF>
extern volatile __bit                   I2C1TXIF            __at(0x1CD18);	// @ (0x39A3 * 8 + 0)
#define                                 I2C1TXIF_bit        _BIT_ACCESS(PIR3,0)
// IPR3<I2C1TXIP>
extern volatile __bit                   I2C1TXIP            __at(0x1CC18);	// @ (0x3983 * 8 + 0)
#define                                 I2C1TXIP_bit        _BIT_ACCESS(IPR3,0)
// PIE6<I2C2EIE>
extern volatile __bit                   I2C2EIE             __at(0x1CCB1);	// @ (0x3996 * 8 + 1)
#define                                 I2C2EIE_bit         _BIT_ACCESS(PIE6,1)
// PIR6<I2C2EIF>
extern volatile __bit                   I2C2EIF             __at(0x1CD31);	// @ (0x39A6 * 8 + 1)
#define                                 I2C2EIF_bit         _BIT_ACCESS(PIR6,1)
// IPR6<I2C2EIP>
extern volatile __bit                   I2C2EIP             __at(0x1CC31);	// @ (0x3986 * 8 + 1)
#define                                 I2C2EIP_bit         _BIT_ACCESS(IPR6,1)
// PIE6<I2C2IE>
extern volatile __bit                   I2C2IE              __at(0x1CCB0);	// @ (0x3996 * 8 + 0)
#define                                 I2C2IE_bit          _BIT_ACCESS(PIE6,0)
// PIR6<I2C2IF>
extern volatile __bit                   I2C2IF              __at(0x1CD30);	// @ (0x39A6 * 8 + 0)
#define                                 I2C2IF_bit          _BIT_ACCESS(PIR6,0)
// IPR6<I2C2IP>
extern volatile __bit                   I2C2IP              __at(0x1CC30);	// @ (0x3986 * 8 + 0)
#define                                 I2C2IP_bit          _BIT_ACCESS(IPR6,0)
// PMD5<I2C2MD>
extern volatile __bit                   I2C2MD              __at(0x1CE29);	// @ (0x39C5 * 8 + 1)
#define                                 I2C2MD_bit          _BIT_ACCESS(PMD5,1)
// PIE5<I2C2RXIE>
extern volatile __bit                   I2C2RXIE            __at(0x1CCAE);	// @ (0x3995 * 8 + 6)
#define                                 I2C2RXIE_bit        _BIT_ACCESS(PIE5,6)
// PIR5<I2C2RXIF>
extern volatile __bit                   I2C2RXIF            __at(0x1CD2E);	// @ (0x39A5 * 8 + 6)
#define                                 I2C2RXIF_bit        _BIT_ACCESS(PIR5,6)
// IPR5<I2C2RXIP>
extern volatile __bit                   I2C2RXIP            __at(0x1CC2E);	// @ (0x3985 * 8 + 6)
#define                                 I2C2RXIP_bit        _BIT_ACCESS(IPR5,6)
// PIE5<I2C2TXIE>
extern volatile __bit                   I2C2TXIE            __at(0x1CCAF);	// @ (0x3995 * 8 + 7)
#define                                 I2C2TXIE_bit        _BIT_ACCESS(PIE5,7)
// PIR5<I2C2TXIF>
extern volatile __bit                   I2C2TXIF            __at(0x1CD2F);	// @ (0x39A5 * 8 + 7)
#define                                 I2C2TXIF_bit        _BIT_ACCESS(PIR5,7)
// IPR5<I2C2TXIP>
extern volatile __bit                   I2C2TXIP            __at(0x1CC2F);	// @ (0x3985 * 8 + 7)
#define                                 I2C2TXIP_bit        _BIT_ACCESS(IPR5,7)
// CPUDOZE<IDLEN>
extern volatile __bit                   IDLEN               __at(0x1CEC7);	// @ (0x39D8 * 8 + 7)
#define                                 IDLEN_bit           _BIT_ACCESS(CPUDOZE,7)
// NCO1INCL<INC0>
extern volatile __bit                   INC0                __at(0x1F9D8);	// @ (0x3F3B * 8 + 0)
#define                                 INC0_bit            _BIT_ACCESS(NCO1INCL,0)
// NCO1INCL<INC1>
extern volatile __bit                   INC1                __at(0x1F9D9);	// @ (0x3F3B * 8 + 1)
#define                                 INC1_bit            _BIT_ACCESS(NCO1INCL,1)
// NCO1INCH<INC10>
extern volatile __bit                   INC10               __at(0x1F9E2);	// @ (0x3F3C * 8 + 2)
#define                                 INC10_bit           _BIT_ACCESS(NCO1INCH,2)
// NCO1INCH<INC11>
extern volatile __bit                   INC11               __at(0x1F9E3);	// @ (0x3F3C * 8 + 3)
#define                                 INC11_bit           _BIT_ACCESS(NCO1INCH,3)
// NCO1INCH<INC12>
extern volatile __bit                   INC12               __at(0x1F9E4);	// @ (0x3F3C * 8 + 4)
#define                                 INC12_bit           _BIT_ACCESS(NCO1INCH,4)
// NCO1INCH<INC13>
extern volatile __bit                   INC13               __at(0x1F9E5);	// @ (0x3F3C * 8 + 5)
#define                                 INC13_bit           _BIT_ACCESS(NCO1INCH,5)
// NCO1INCH<INC14>
extern volatile __bit                   INC14               __at(0x1F9E6);	// @ (0x3F3C * 8 + 6)
#define                                 INC14_bit           _BIT_ACCESS(NCO1INCH,6)
// NCO1INCH<INC15>
extern volatile __bit                   INC15               __at(0x1F9E7);	// @ (0x3F3C * 8 + 7)
#define                                 INC15_bit           _BIT_ACCESS(NCO1INCH,7)
// NCO1INCU<INC16>
extern volatile __bit                   INC16               __at(0x1F9E8);	// @ (0x3F3D * 8 + 0)
#define                                 INC16_bit           _BIT_ACCESS(NCO1INCU,0)
// NCO1INCU<INC17>
extern volatile __bit                   INC17               __at(0x1F9E9);	// @ (0x3F3D * 8 + 1)
#define                                 INC17_bit           _BIT_ACCESS(NCO1INCU,1)
// NCO1INCU<INC18>
extern volatile __bit                   INC18               __at(0x1F9EA);	// @ (0x3F3D * 8 + 2)
#define                                 INC18_bit           _BIT_ACCESS(NCO1INCU,2)
// NCO1INCU<INC19>
extern volatile __bit                   INC19               __at(0x1F9EB);	// @ (0x3F3D * 8 + 3)
#define                                 INC19_bit           _BIT_ACCESS(NCO1INCU,3)
// NCO1INCL<INC2>
extern volatile __bit                   INC2                __at(0x1F9DA);	// @ (0x3F3B * 8 + 2)
#define                                 INC2_bit            _BIT_ACCESS(NCO1INCL,2)
// NCO1INCL<INC3>
extern volatile __bit                   INC3                __at(0x1F9DB);	// @ (0x3F3B * 8 + 3)
#define                                 INC3_bit            _BIT_ACCESS(NCO1INCL,3)
// NCO1INCL<INC4>
extern volatile __bit                   INC4                __at(0x1F9DC);	// @ (0x3F3B * 8 + 4)
#define                                 INC4_bit            _BIT_ACCESS(NCO1INCL,4)
